Revit 2024 API
BuiltInFailures.SketchFailures.MissingLapInSketch Property
 Rebar Sketch does not have lapped lengths. A circular shaped Rebar needs overlapping legths. Please overlap one of the ends of the circular Rebar Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MissingLapInSketch { get; }
Visual Basic
Public Shared ReadOnly Property MissingLapInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MissingLapInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace